# ConnectionInputPoint Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionInputPoint Constructor
ConnectionInputPoint Class See Also
---
Construct a default input point.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ConnectionInputPoint()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ConnectionInputPoint()
```

# See Also
ConnectionInputPoint Class
ConnectionInputPoint Overload
Autodesk.Revit.DB.Structure Namespace